<?php
defined('BASEPATH') OR exit('No direct script access allowed');

$lang['db_invalid_connection_str'] = 'আপনি প্রদত্ত সংযোগ স্ট্রিং-এর ভিত্তিতে ডাটাবেস সেটিংস নির্ধারণ করতে সক্ষম নন।';
$lang['db_unable_to_connect'] = 'প্রদত্ত সেটিংস ব্যবহার করে আপনার ডাটাবেস সার্ভারে সংযোগ স্থাপন করা যাচ্ছে না।';
$lang['db_unable_to_select'] = 'নির্দিষ্ট ডাটাবেস নির্বাচন করা যাচ্ছে না: %s';
$lang['db_unable_to_create'] = 'নির্দিষ্ট ডাটাবেস তৈরি করা যাচ্ছে না: %s';
$lang['db_invalid_query'] = 'আপনার দেওয়া কোয়েরিটি সঠিক নয়।';
$lang['db_must_set_table'] = 'আপনাকে অবশ্যই কোয়েরির জন্য একটি ডাটাবেস টেবিল নির্ধারণ করতে হবে।';
$lang['db_must_use_set'] = 'আপনাকে অবশ্যই একটি এন্ট্রি আপডেট করতে "set" মেথড ব্যবহার করতে হবে।';
$lang['db_must_use_index'] = 'ব্যাচ আপডেট করার জন্য আপনাকে অবশ্যই একটি সূচক (index) নির্দিষ্ট করতে হবে।';
$lang['db_batch_missing_index'] = 'ব্যাচ আপডেট করার জন্য পাঠানো এক বা একাধিক সারিতে নির্দিষ্ট সূচক অনুপস্থিত।';
$lang['db_must_use_where'] = 'আপডেটস শুধুমাত্র তখনই অনুমোদিত যদি সেগুলিতে একটি "where" ক্লজ থাকে।';
$lang['db_del_must_use_where'] = 'ডিলিট শুধুমাত্র তখনই অনুমোদিত যদি সেগুলিতে একটি "where" অথবা "like" ক্লজ থাকে।';
$lang['db_field_param_missing'] = 'ফিল্ডগুলি আনার জন্য টেবিলের নাম প্যারামিটার হিসেবে দিতে হবে।';
$lang['db_unsupported_function'] = 'আপনি যে ডাটাবেস ব্যবহার করছেন এই ফিচারটি উপলব্ধ নয়।';
$lang['db_transaction_failure'] = 'লেনদেন ব্যর্থ হয়েছে: রোলব্যাক করা হয়েছে।';
$lang['db_unable_to_drop'] = 'নির্দিষ্ট ডাটাবেস ড্রপ করা যাচ্ছে না।';
$lang['db_unsupported_feature'] = 'আপনি যে ডাটাবেস প্ল্যাটফর্ম ব্যবহার করছেন এটি সমর্থন করে না।';
$lang['db_unsupported_compression'] = 'আপনি যে ফাইল কম্প্রেশন ফরম্যাটটি বেছে নিয়েছেন তা আপনার সার্ভার দ্বারা সমর্থিত নয়।';
$lang['db_filepath_error'] = 'আপনি যেই ফাইল পাথটি দিয়েছেন সেখানে ডেটা লেখতে পারছি না।';
$lang['db_invalid_cache_path'] = 'আপনি যেই ক্যাশ পাথটি দিয়েছেন তা বৈধ নয় অথবা লেখার যোগ্য নয়।';
$lang['db_table_name_required'] = 'এই অপারেশনের জন্য একটি টেবিল নাম প্রয়োজন।';
$lang['db_column_name_required'] = 'এই অপারেশনের জন্য একটি কলাম নাম প্রয়োজন।';
$lang['db_column_definition_required'] = 'এই অপারেশনের জন্য একটি কলাম সংজ্ঞা প্রয়োজন।';
$lang['db_unable_to_set_charset'] = 'ক্লায়েন্ট সংযোগ ক্যারেক্টার সেট সেট করতে পারছি না: %s';
$lang['db_error_heading'] = 'একটি ডাটাবেস ত্রুটি ঘটেছে';
