<?php
defined('BASEPATH') OR exit('No direct script access allowed');

$lang['ftp_no_connection']        = 'বৈধ কোনো কানেকশন আইডি পাওয়া যায়নি। দয়া করে ফাইল অপারেশন করার আগে নিশ্চিত হোন আপনি সংযুক্ত আছেন।';
$lang['ftp_unable_to_connect']    = 'প্রদত্ত হোস্টনেম ব্যবহার করে FTP সার্ভারে সংযোগ স্থাপন করা সম্ভব হয়নি।';
$lang['ftp_unable_to_login']      = 'FTP সার্ভারে লগইন করা যায়নি। দয়া করে ইউজারনেম এবং পাসওয়ার্ড পরীক্ষা করুন।';
$lang['ftp_unable_to_mkdir']      = 'আপনি যে ডিরেক্টরি নির্দিষ্ট করেছেন তা তৈরি করা সম্ভব হয়নি।';
$lang['ftp_unable_to_changedir']  = 'ডিরেক্টরি পরিবর্তন করা সম্ভব হয়নি।';
$lang['ftp_unable_to_chmod']      = 'ফাইলের পারমিশন সেট করা সম্ভব হয়নি। দয়া করে আপনার পাথ পরীক্ষা করুন।';
$lang['ftp_unable_to_upload']     = 'নির্দিষ্ট ফাইল আপলোড করা সম্ভব হয়নি। দয়া করে আপনার পাথ পরীক্ষা করুন।';
$lang['ftp_unable_to_download']   = 'নির্দিষ্ট ফাইল ডাউনলোড করা সম্ভব হয়নি। দয়া করে আপনার পাথ পরীক্ষা করুন।';
$lang['ftp_no_source_file']       = 'সোর্স ফাইল খুঁজে পাওয়া যায়নি। দয়া করে আপনার পাথ পরীক্ষা করুন।';
$lang['ftp_unable_to_rename']     = 'ফাইলের নাম পরিবর্তন করা সম্ভব হয়নি।';
$lang['ftp_unable_to_delete']     = 'ফাইল মুছে ফেলা সম্ভব হয়নি।';
$lang['ftp_unable_to_move']       = 'ফাইল সরানো সম্ভব হয়নি। দয়া করে নিশ্চিত করুন যে গন্তব্য ডিরেক্টরি বিদ্যমান আছে।';
